In [ ]:
!pip install psycopg2-binary
!pip install sqlalchemy
!pip install xgboost
!pip install mlxtend
!pip install imblearn

In [4]:
import pandas as pd
import psycopg2
import sqlalchemy 
import pyodbc
import seaborn as sns
import matplotlib.pyplot as plt

from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import LinearSVC, SVC
from xgboost import XGBClassifier

from sklearn import metrics
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score, precision_score, recall_score, precision_recall_curve, f1_score
from sklearn.metrics import roc_auc_score, roc_curve

from sklearn.model_selection import GridSearchCV
from sklearn.model_selection import RandomizedSearchCV


from collections import Counter
from mlxtend.plotting import plot_decision_regions

from imblearn.over_sampling import RandomOverSampler
from imblearn.over_sampling import SMOTE
from imblearn.over_sampling import ADASYN
from imblearn.over_sampling import BorderlineSMOTE
from imblearn.under_sampling import RandomUnderSampler

Requirement already satisfied: psycopg2-binary in c:\users\bahar.inan\anaconda3\lib\site-packages (2.9.7)
Requirement already satisfied: sqlalchemy in c:\users\bahar.inan\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\bahar.inan\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: xgboost in c:\users\bahar.inan\anaconda3\lib\site-packages (2.0.0)
Requirement already satisfied: scipy in c:\users\bahar.inan\anaconda3\lib\site-packages (from xgboost) (1.9.1)
Requirement already satisfied: numpy in c:\users\bahar.inan\anaconda3\lib\site-packages (from xgboost) (1.21.5)
Requirement already satisfied: mlxtend in c:\users\bahar.inan\anaconda3\lib\site-packages (0.23.0)
Requirement already satisfied: matplotlib>=3.0.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from mlxtend) (3.5.2)
Requirement already satisfied: numpy>=1.16.2 in c:\users\bahar.inan\anaconda3\lib\site-packages (from mlxtend) (1.21.5)
Requirement already satisfied: joblib>=0.13.2 in c:\users\bahar.inan\anaconda3\lib\site-packages (from mlxtend) (1.1.0)
Requirement already satisfied: pandas>=0.24.2 in c:\users\bahar.inan\anaconda3\lib\site-packages (from mlxtend) (1.4.4)
Requirement already satisfied: scikit-learn>=1.0.2 in c:\users\bahar.inan\anaconda3\lib\site-packages (from mlxtend) (1.0.2)
Requirement already satisfied: scipy>=1.2.1 in c:\users\bahar.inan\anaconda3\lib\site-packages (from mlxtend) (1.9.1)
Requirement already satisfied: packaging>=20.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (21.3)
Requirement already satisfied: cycler>=0.10 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (0.11.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (2.8.2)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (1.4.2)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (4.25.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (9.2.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bahar.inan\anaconda3\lib\site-packages (from pandas>=0.24.2->mlxtend) (2022.1)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from scikit-learn>=1.0.2->mlxtend) (2.2.0)
Requirement already satisfied: six>=1.5 in c:\users\bahar.inan\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=3.0.0->mlxtend) (1.16.0)
Collecting imblearn
  Downloading imblearn-0.0-py2.py3-none-any.whl (1.9 kB)
Collecting imbalanced-learn
  Downloading imbalanced_learn-0.11.0-py3-none-any.whl (235 kB)
     -------------------------------------- 235.6/235.6 kB 2.1 MB/s eta 0:00:00
Collecting joblib>=1.1.1
  Downloading joblib-1.3.2-py3-none-any.whl (302 kB)
     -------------------------------------- 302.2/302.2 kB 6.2 MB/s eta 0:00:00
Requirement already satisfied: scipy>=1.5.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from imbalanced-learn->imblearn) (1.9.1)
Requirement already satisfied: numpy>=1.17.3 in c:\users\bahar.inan\anaconda3\lib\site-packages (from imbalanced-learn->imblearn) (1.21.5)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\bahar.inan\anaconda3\lib\site-packages (from imbalanced-learn->imblearn) (2.2.0)
Requirement already satisfied: scikit-learn>=1.0.2 in c:\users\bahar.inan\anaconda3\lib\site-packages (from imbalanced-learn->imblearn) (1.0.2)
Installing collected packages: joblib, imbalanced-learn, imblearn
  Attempting uninstall: joblib
    Found existing installation: joblib 1.1.0
    Uninstalling joblib-1.1.0:
      Successfully uninstalled joblib-1.1.0
Successfully installed imbalanced-learn-0.11.0 imblearn-0.0 joblib-1.3.2

In [34]:
params = {
    "host": "localhost",
    "user": "postgres",
    "port": 5432,
    "password": "Aibu2008" 
}
connection = psycopg2.connect(**params, dbname= "postgres")

In [35]:
df=pd.read_sql('select * from public.customer_churn',connection)

In [36]:
connection.close()

In [37]:
df

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,15606229,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,15569892,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,15584532,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,15682355,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,15628319,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [38]:
df.drop(columns='customer_id',inplace=True) #customer id anlamlı bir feature olmadığından siliyoruz

In [39]:
df.info() 
"""
hiç null değer yok. Object olan country ve gender için get dummies yapalım
age değişkeni için de Discretization uygulayalım.
"""

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   credit_score      10000 non-null  int64
 1   country           10000 non-null  object
 2   gender            10000 non-null  object
 3   age               10000 non-null  int64
 4   tenure            10000 non-null  int64
 5   balance           10000 non-null  float64
 6   products_number   10000 non-null  int64
 7   credit_card       10000 non-null  int64
 8   active_member     10000 non-null  int64
 9   estimated_salary  10000 non-null  float64
 10  churn             10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

'\nhiç null değer yok. Object olan country ve gender için get dummies yapalım\nage değişkeni için de Discretization uygulayalım.\n'

In [40]:
df = pd.get_dummies(df, columns=['country','gender'],  drop_first=True)
df

,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,country_Germany,country_Spain,gender_Male
0,619,42,2,0.00,1,1,1,101348.88,1,0,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,1,0
2,502,42,8,159660.80,3,1,0,113931.57,1,0,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,0,0,0,1
9996,516,35,10,57369.61,1,1,1,101699.77,0,0,0,1
9997,709,36,7,0.00,1,0,1,42085.58,1,0,0,0
9998,772,42,3,75075.31,2,1,0,92888.52,1,1,0,1
9999,792,28,4,130142.79,1,1,0,38190.78,0,0,0,0

In [44]:
df.describe() #yaş min 18 max 92 olduğunu gördük. 18-32 / 33-44 / 45-60 / 60+ olarak gruplayabiliriz

,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,country_Germany,country_Spain,gender_Male
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000
mean,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700,0.250900,0.247700,0.545700
std,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769,0.433553,0.431698,0.497932
min,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000,0.000000,0.000000,0.000000
25%,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000,0.000000,0.000000,0.000000
50%,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000,0.000000,0.000000,1.000000
75%,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000,1.000000,0.000000,1.000000
max,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000,1.000000,1.000000,1.000000

In [46]:
def discretizate(age):
    if age <=32:
        return '18-32'
    elif age <=44:
        return '33-44'
    elif age <=60:
        return '45-60'
    else:
        return '60+'

In [47]:
df['age_group'] = df['age'].apply(discretizate)
df

,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,country_Germany,country_Spain,gender_Male,age_group
0,619,42,2,0.00,1,1,1,101348.88,1,0,0,0,33-44
1,608,41,1,83807.86,1,0,1,112542.58,0,0,1,0,33-44
2,502,42,8,159660.80,3,1,0,113931.57,1,0,0,0,33-44
3,699,39,1,0.00,2,0,0,93826.63,0,0,0,0,33-44
4,850,43,2,125510.82,1,1,1,79084.10,0,0,1,0,33-44
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,0,0,0,1,33-44
9996,516,35,10,57369.61,1,1,1,101699.77,0,0,0,1,33-44
9997,709,36,7,0.00,1,0,1,42085.58,1,0,0,0,33-44
9998,772,42,3,75075.31,2,1,0,92888.52,1,1,0,1,33-44
9999,792,28,4,130142.79,1,1,0,38190.78,0,0,0,0,18-32

In [48]:
age_group_dic = {'60+':3, '45-60':2, '33-44':1, '18-32':0}  

df['age_group'] = df['age_group'].map(age_group_dic)
df

,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,country_Germany,country_Spain,gender_Male,age_group
0,619,42,2,0.00,1,1,1,101348.88,1,0,0,0,1
1,608,41,1,83807.86,1,0,1,112542.58,0,0,1,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,0,0,1
3,699,39,1,0.00,2,0,0,93826.63,0,0,0,0,1
4,850,43,2,125510.82,1,1,1,79084.10,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64,0,0,0,1,1
9996,516,35,10,57369.61,1,1,1,101699.77,0,0,0,1,1
9997,709,36,7,0.00,1,0,1,42085.58,1,0,0,0,1
9998,772,42,3,75075.31,2,1,0,92888.52,1,1,0,1,1
9999,792,28,4,130142.79,1,1,0,38190.78,0,0,0,0,0

In [49]:
df.drop(columns='age',inplace=True) #age kolonunu da drop edelim.

In [53]:
df.info() #tüm değişknlerin tipi int ya da float oldu
df.isnull().sum() #hiç null değer de yok

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   credit_score      10000 non-null  int64
 1   tenure            10000 non-null  int64
 2   balance           10000 non-null  float64
 3   products_number   10000 non-null  int64
 4   credit_card       10000 non-null  int64
 5   active_member     10000 non-null  int64
 6   estimated_salary  10000 non-null  float64
 7   churn             10000 non-null  int64
 8   country_Germany   10000 non-null  uint8
 9   country_Spain     10000 non-null  uint8
 10  gender_Male       10000 non-null  uint8
 11  age_group         10000 non-null  int64
dtypes: float64(2), int64(7), uint8(3)
memory usage: 732.5 KB

credit_score        0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
country_Germany     0
country_Spain       0
gender_Male         0
age_group           0
dtype: int64

In [56]:
df

,credit_score,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,country_Germany,country_Spain,gender_Male,age_group
0,619,2,0.00,1,1,1,101348.88,1,0,0,0,1
1,608,1,83807.86,1,0,1,112542.58,0,0,1,0,1
2,502,8,159660.80,3,1,0,113931.57,1,0,0,0,1
3,699,1,0.00,2,0,0,93826.63,0,0,0,0,1
4,850,2,125510.82,1,1,1,79084.10,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,5,0.00,2,1,0,96270.64,0,0,0,1,1
9996,516,10,57369.61,1,1,1,101699.77,0,0,0,1,1
9997,709,7,0.00,1,0,1,42085.58,1,0,0,0,1
9998,772,3,75075.31,2,1,0,92888.52,1,1,0,1,1
9999,792,4,130142.79,1,1,0,38190.78,0,0,0,0,0

In [ ]:
#train ve test ayrımı ile modelleri deneyelim.